
import { Button } from "@mui/material";
import React, { useState } from "react";
import { Redirect } from "react-router-dom/cjs/react-router-dom.min";
import HomeAbout from "../home/home";

export default function About() {

    const [flag, setFlag] = useState(false)
    if (flag)
        return <Redirect to="/login/driver"></Redirect>
    return (
        <>
            <div className="box about">
                <h1>שלום לך ותודה שהצטרפת ל Find Your Way</h1>
                {/* <p> */}
                <h2>בשביל מה?</h2>
                <div>האפליקציה נועדה לסייע לספקים, המתעסקים עם חנויות רבות.</div>
                <div>לשם הדוגמא, הספק של מאפית אנגל, מחויב לספק לחנויות המזמינות לחם מידי יום.
                </div>
                <div>
                    יש ברשותו משאיות של אנגל הממונות על חלוקת הסחורה.
                </div>
                <div>
                    האפליקציה תחשב עבור כל משאית מסלול אופטימלי של החנויות  שבהן היא תחלק את הלחם,
                    כך שכל חנות תקבל את כמות הלחם הדרושה עבורה.
                </div>
                <div>
                    האפליקציה תתייחס גם לאילוצים הבאים:
                </div>
                <div>
                    מצד המשאית – כמות הלחם שהמשאית מכילה לא תעלה על כמות ההזמנות מהחנויות,
                </div><div>
                    מצד החנויות- כל חנות תקבל את הלחם בטווח מסוים של השעות שהיא דורשת.
                </div><div>
                    לדוגמא החנות נפתחת ב 6:00 בבוקר, בעל החנות רוצה שהלחם יגיע עד השעה 08:00. האפליקציה תדאג לכך שהמשאית תגיע לחנות בשעות 06:00-08:00.
                </div>
                <h2>איך משתמשים באפליקציה?</h2>
                <div>זה פשוט מאוד.
                    <br />

                    עליך רק להוסיף למאגר את החנויות שמזמינות ממך סחורה, את פרטי המשאיות המשמשות אותך,וכבר תוכל לצפות במפת המסלולים עבור כל נהג.
                    <br />
                    בנוסף לכך, גם כל אחד מנהגי המשאיות יוכל להיכנס לאפליקציה ולצפות במסלול שהוכן עבורו.
                </div>
                <br />
                <h3>אז בהנאה!!!</h3>

               
                <Button onClick={() => { setFlag(true) }}>כניסה</Button>
            </div>
        </>
    )
}